app/controllers/cars_controller.rb

SELECT "makes".* FROM "makes"
---
  def new
    @car = Car.new
    @parts = Part.all
    @makes = Make.all

SELECT "cars".* FROM "cars" WHERE (VIN like '%%')
---
  def search
    @cars = Car.where('VIN like ?', "%#{params[:query]}%")