app/controllers/makes_controller.rb

  def index
    @makes = Make.all
---
SELECT "makes".* FROM "makes"

  def create
    @make = Make.new(make_params)

    respond_to do |format|
      if @make.save
---
INSERT INTO "makes" ("name", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Ford"], ["country", "USA"], ["created_at", "2019-10-06 21:43:21.627143"], ["updated_at", "2019-10-06 21:43:21.627143"]]

    def set_make
      @make = Make.find(params[:id])
---
SELECT  "makes".* FROM "makes" WHERE "makes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]