app/controllers/parts_controller.rb

INSERT INTO "parts" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Brakes"], ["created_at", "2019-11-26 23:38:53.646243"], ["updated_at", "2019-11-26 23:38:53.646243"]]
---
  def create
    @part = Part.new(part_params)

    respond_to do |format|
      if @part.save